'use strict';

// Задание 2: 
 
// 1. Найти остаток от деления переменных `a` на `b`, где a = 13, b = 5.
// const a = 13;
// const b = 5;
// const remane = 13 % 5;
// alert (remane);

// 2. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// let a;
// alert(a); 
// undefined (потому что создали переменную и ничего туда не положили)
// В чем разница с null? мы никогда не присваеваем в переменную undefined, а null можно присвоить
// 3. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// alert('abc' * 3);
// NaN
//  а если будет так ('5' * 3), то результатом будет 15. Потому что джава скрипт автоматически переводит строку в число и умножает
// 4. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// alert(1 / 0);  бесконечность
// alert(-1 / 0); отриц бесконечность
// ```
// 5. Что выведет на экран (Сначала проговорите, потом проверьте)
// ```
// alert('2' * '3'); будет 6
// ```