'use strict';

// Задание 3: 
// 1. Сознательно допустите ошибку в вашем коде. Убедитесь, что ошибка появляется 
// в консоли. Определите, в какой строке кода случилась ошибка.
// const a = 5;
// a = 6;
// 2. Необходимо вывести в консоль результат суммы переменных a = '2', b = '3'.
// const a = '2';
// const b = '3';
// console.log(a + b);

// 3. Пользователь с клавиатуры вводит 2 числа, необходимо в консоль вывести весь 
// текст ниже, одной строкой с переносами строк:
 
// Сумма чисел равна “результат”.
// Разность чисел равна “результат”.
// Произведение чисел равно “результат”.
// Частное чисел равно “результат”.
// Остаток от деления чисел равен “результат”.

// const c = Number.parseInt(prompt('enter n'));
// const d = Number.parseInt(prompt('enter m'));
// alert(`Сумма чисел равна ${c + d}
// Разность чисел равна ${c - d}
// Произведение чисел равно ${c * d}
// Частное чисел равно ${c / d}
// Остаток от деления чисел равен ${c % d}
// `);


